In [84]:
import numpy as np
import pandas as pd

In [2]:
L = [1,2,3,4]
s = pd.Series(L)
s

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
L = [1,2,3,4]
s = pd.Series(L, index = ['a','b','c','d'])
s

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
s['c']

3

In [6]:
s['c'] = 10

In [7]:
s

a     1
b     2
c    10
d     4
dtype: int64

In [8]:
s[['c','d']]

c    10
d     4
dtype: int64

In [9]:
s > 5

a    False
b    False
c     True
d    False
dtype: bool

In [12]:
s * 2

a     2
b     4
c    20
d     8
dtype: int64

In [18]:
'c' in s

True

In [19]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [20]:
s.values

array([ 1,  2, 10,  4], dtype=int64)

In [21]:
s.index = ['가','나','다','라']

In [24]:
s['가'] = 5

In [25]:
s

가     5
나     2
다    10
라     4
dtype: int64

In [85]:
raw_data = {'first_name' : ['jason', np.nan, 'tina', 'jake', 'may'],
           'last_name' : ['miller', np.nan, 'ali', 'milner', 'coozer'],
           'age': [42, np.nan, 36, 24, 73],
           'postestscore': [25, np.nan, np.nan, 62, 72]}
raw_data

{'first_name': ['jason', nan, 'tina', 'jake', 'may'],
 'last_name': ['miller', nan, 'ali', 'milner', 'coozer'],
 'age': [42, nan, 36, 24, 73],
 'postestscore': [25, nan, nan, 62, 72]}

In [86]:
df = pd.DataFrame(raw_data, index = ['a','b','c','d','e'])
df

  first_name last_name   age  postestscore
a      jason    miller  42.0          25.0
b        NaN       NaN   NaN           NaN
c       tina       ali  36.0           NaN
d       jake    milner  24.0          62.0
e        may    coozer  73.0          72.0

In [87]:
df['first_name']

a    jason
b      NaN
c     tina
d     jake
e      may
Name: first_name, dtype: object

In [88]:
df[['last_name', 'age', 'postestscore']]

  last_name   age  postestscore
a    miller  42.0          25.0
b       NaN   NaN           NaN
c       ali  36.0           NaN
d    milner  24.0          62.0
e    coozer  73.0          72.0

In [89]:
df.age

a    42.0
b     NaN
c    36.0
d    24.0
e    73.0
Name: age, dtype: float64

In [90]:
df['age'] = df['age'].apply(lambda x : x * 2)

In [91]:
df['age']

a     84.0
b      NaN
c     72.0
d     48.0
e    146.0
Name: age, dtype: float64

In [92]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [93]:
df.columns

Index(['first_name', 'last_name', 'age', 'postestscore'], dtype='object')

In [94]:
df.values

array([['jason', 'miller', 84.0, 25.0],
       [nan, nan, nan, nan],
       ['tina', 'ali', 72.0, nan],
       ['jake', 'milner', 48.0, 62.0],
       ['may', 'coozer', 146.0, 72.0]], dtype=object)

In [95]:
df.loc['a']

first_name       jason
last_name       miller
age               84.0
postestscore      25.0
Name: a, dtype: object

In [96]:
df.loc['e']

first_name         may
last_name       coozer
age              146.0
postestscore      72.0
Name: e, dtype: object

In [97]:
df.loc[:'b']

  first_name last_name   age  postestscore
a      jason    miller  84.0          25.0
b        NaN       NaN   NaN           NaN

In [98]:
df.iloc[3]

first_name        jake
last_name       milner
age               48.0
postestscore      62.0
Name: d, dtype: object

In [99]:
df.iloc[:4]

  first_name last_name   age  postestscore
a      jason    miller  84.0          25.0
b        NaN       NaN   NaN           NaN
c       tina       ali  72.0           NaN
d       jake    milner  48.0          62.0

In [100]:
df.iloc[3:]

  first_name last_name    age  postestscore
d       jake    milner   48.0          62.0
e        may    coozer  146.0          72.0

In [101]:
df.loc[['a','c']]

  first_name last_name   age  postestscore
a      jason    miller  84.0          25.0
c       tina       ali  72.0           NaN

In [102]:
df.loc['a', ['first_name', 'age']]

first_name    jason
age            84.0
Name: a, dtype: object

In [103]:
df.loc[['c','d'], 'last_name':'postestscore']

  last_name   age  postestscore
c       ali  72.0           NaN
d    milner  48.0          62.0

In [104]:
df.loc['c']

first_name      tina
last_name        ali
age             72.0
postestscore     NaN
Name: c, dtype: object

In [105]:
df.loc['c', 'last_name'] = 'alio'

In [106]:
df.iloc[[2,4],2:4]

     age  postestscore
c   72.0           NaN
e  146.0          72.0

In [107]:
df.iloc[1:5:2]

  first_name last_name   age  postestscore
b        NaN       NaN   NaN           NaN
d       jake    milner  48.0          62.0

In [108]:
df.loc[df['age'] >= 40]

  first_name last_name    age  postestscore
a      jason    miller   84.0          25.0
c       tina      alio   72.0           NaN
d       jake    milner   48.0          62.0
e        may    coozer  146.0          72.0

In [109]:
df.loc[df['last_name'] == 'coozer']

  first_name last_name    age  postestscore
e        may    coozer  146.0          72.0

In [112]:
# 나이가 40 이상인 사람의 postestscore 평균점수는 얼마인가?
df.loc[df['age'] >= 40]['postestscore'].mean()

53.0

In [113]:
df['address'] = ['seoul', 'incheon', 'daejeon', 'pusan', 'gwangju']
df

  first_name last_name    age  postestscore  address
a      jason    miller   84.0          25.0    seoul
b        NaN       NaN    NaN           NaN  incheon
c       tina      alio   72.0           NaN  daejeon
d       jake    milner   48.0          62.0    pusan
e        may    coozer  146.0          72.0  gwangju

In [115]:
df.columns = ['fn', 'ln', 'age', 'posts', 'add']
df

      fn      ln    age  posts      add
a  jason  miller   84.0   25.0    seoul
b    NaN     NaN    NaN    NaN  incheon
c   tina    alio   72.0    NaN  daejeon
d   jake  milner   48.0   62.0    pusan
e    may  coozer  146.0   72.0  gwangju

In [118]:
df.rename(columns = {'ln' : 'last_name'}, inplace = True)

In [119]:
df

      fn last_name    age  posts      add
a  jason    miller   84.0   25.0    seoul
b    NaN       NaN    NaN    NaN  incheon
c   tina      alio   72.0    NaN  daejeon
d   jake    milner   48.0   62.0    pusan
e    may    coozer  146.0   72.0  gwangju

In [120]:
df.drop('add', axis = 1)

      fn last_name    age  posts
a  jason    miller   84.0   25.0
b    NaN       NaN    NaN    NaN
c   tina      alio   72.0    NaN
d   jake    milner   48.0   62.0
e    may    coozer  146.0   72.0

In [122]:
df.drop('c')

      fn last_name    age  posts      add
a  jason    miller   84.0   25.0    seoul
b    NaN       NaN    NaN    NaN  incheon
d   jake    milner   48.0   62.0    pusan
e    may    coozer  146.0   72.0  gwangju

In [123]:
df.tail(2)

     fn last_name    age  posts      add
d  jake    milner   48.0   62.0    pusan
e   may    coozer  146.0   72.0  gwangju

In [124]:
np.random.randn(5,5)

array([[ 1.18746439, -0.69598459, -2.9563949 , -2.22575837,  0.66341473],
       [-0.10251778,  2.15996185,  2.04760844, -1.68323279,  0.11658624],
       [-0.56329786, -0.7753046 , -0.39161279, -0.33777836,  0.1260809 ],
       [-0.48234355,  0.7805191 ,  0.65571587, -0.3274859 , -0.19168917],
       [ 2.49149577, -0.78491811,  1.7246418 , -1.56641325,  0.67827672]])

In [126]:
df = pd.DataFrame(np.random.randn(5,5))
df

          0         1         2         3         4
0 -0.374668 -0.492409  0.022279  0.672336 -0.287483
1  0.591385  0.468087 -1.208750  0.138678  1.209435
2 -0.989833 -0.657683 -1.431297 -0.519212 -0.255363
3  0.362695 -0.961828 -0.476382  0.304132  0.709459
4 -0.892848 -0.068918 -1.635383 -1.178497 -1.576287

In [127]:
df.index = ['a', 'b', 'c', 'd', 'e']

In [129]:
df.columns = ['one', 'two', 'three', 'four', 'five']

In [130]:
df

        one       two     three      four      five
a -0.374668 -0.492409  0.022279  0.672336 -0.287483
b  0.591385  0.468087 -1.208750  0.138678  1.209435
c -0.989833 -0.657683 -1.431297 -0.519212 -0.255363
d  0.362695 -0.961828 -0.476382  0.304132  0.709459
e -0.892848 -0.068918 -1.635383 -1.178497 -1.576287

In [132]:
df.iloc[3:, 2] = np.nan
df.iloc[2, 2:4] = np.nan
df

        one       two     three      four      five
a -0.374668 -0.492409  0.022279  0.672336 -0.287483
b  0.591385  0.468087 -1.208750  0.138678  1.209435
c -0.989833 -0.657683       NaN       NaN -0.255363
d  0.362695 -0.961828       NaN  0.304132  0.709459
e -0.892848 -0.068918       NaN -1.178497 -1.576287

In [134]:
df.isnull().sum()

one      0
two      0
three    3
four     1
five     0
dtype: int64

In [135]:
df.dropna()

        one       two     three      four      five
a -0.374668 -0.492409  0.022279  0.672336 -0.287483
b  0.591385  0.468087 -1.208750  0.138678  1.209435

In [136]:
df.dropna(axis = 1)

        one       two      five
a -0.374668 -0.492409 -0.287483
b  0.591385  0.468087  1.209435
c -0.989833 -0.657683 -0.255363
d  0.362695 -0.961828  0.709459
e -0.892848 -0.068918 -1.576287

In [137]:
df.fillna('가')

        one       two     three      four      five
a -0.374668 -0.492409  0.022279  0.672336 -0.287483
b  0.591385  0.468087  -1.20875  0.138678  1.209435
c -0.989833 -0.657683         가         가 -0.255363
d  0.362695 -0.961828         가  0.304132  0.709459
e -0.892848 -0.068918         가 -1.178497 -1.576287

In [138]:
df.fillna(df.mean())

        one       two     three      four      five
a -0.374668 -0.492409  0.022279  0.672336 -0.287483
b  0.591385  0.468087 -1.208750  0.138678  1.209435
c -0.989833 -0.657683 -0.593236 -0.015837 -0.255363
d  0.362695 -0.961828 -0.593236  0.304132  0.709459
e -0.892848 -0.068918 -0.593236 -1.178497 -1.576287

In [139]:
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'Giant', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Giant     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [142]:
df.groupby('Team')['Points'].mean()

Team
Devils    768.000000
Giant     812.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
Name: Points, dtype: float64

In [144]:
df.groupby('Team')['Rank'].min()

Team
Devils    2
Giant     4
Kings     1
Riders    1
Royals    1
Name: Rank, dtype: int64

In [145]:
# 연도별 최고 점수는
df.groupby('Year')['Points'].max()

Year
2014    876
2015    812
2016    756
2017    788
Name: Points, dtype: int64

In [147]:
# 팀별 데이터 수는?
df.groupby('Team').size()

Team
Devils    2
Giant     1
Kings     3
Riders    4
Royals    2
dtype: int64

In [148]:
# 팀별, 연도별 포인트 평균은?
df.groupby(['Team', 'Year'])['Points'].mean()

Team    Year
Devils  2014    863.0
        2015    673.0
Giant   2015    812.0
Kings   2014    741.0
        2016    756.0
        2017    788.0
Riders  2014    876.0
        2015    789.0
        2016    694.0
        2017    690.0
Royals  2014    701.0
        2015    804.0
Name: Points, dtype: float64